<template>
	<section id="4" class="stages-works container-content">
		<div
			class="section-title fadeoutbottom"
			v-animateonscroll="{
				enterClass: 'fadeinbottom',
			}"
			:style="{ transitionDelay: '50ms' }"
		>
			<div class="title">
				<h2>Этапы работ по созданию сайта</h2>
			</div>
		</div>
		<TabsWrapper
			class="fadeoutbottom"
			v-animateonscroll="{
				enterClass: 'fadeinbottom',
			}"
			:style="{ transitionDelay: '50ms' }"
		>
			<Tab v-for="(tab, index) in stages" :key="tab" :title="tab.title">
				<div class="tab-content-top">
					<p class="tab-content-top-title">
						<span class="tab-content-top-title-number">{{ ++index }} - </span
						>{{ tab.title }}
					</p>
					<p class="tab-content-top-description" v-html="tab.tabContentTop"></p>
				</div>
				<div class="tab-content-bottom">
					<ul class="tab-content-bottom-right">
						<li v-for="item in tab.tabConBotR">
							<div>
								<svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
									<g id="SVGRepo_bgCarrier" stroke-width="0"></g>
									<g
										id="SVGRepo_tracerCarrier"
										stroke-linecap="round"
										stroke-linejoin="round"
									></g>
									<g id="SVGRepo_iconCarrier">
										<g id="Interface / Check">
											<path
												id="Vector"
												d="M6 12L10.2426 16.2426L18.727 7.75732"
												stroke-width="2"
												stroke-linecap="round"
												stroke-linejoin="round"
											></path>
										</g>
									</g>
								</svg>
							</div>

							<span>{{ item.title }}</span>
						</li>
					</ul>
					<ul class="tab-content-bottom-left">
						<li v-for="item in tab.tabConBotL">
							<div>
								<svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg">
									<g id="SVGRepo_bgCarrier" stroke-width="0"></g>
									<g
										id="SVGRepo_tracerCarrier"
										stroke-linecap="round"
										stroke-linejoin="round"
									></g>
									<g id="SVGRepo_iconCarrier">
										<g id="Interface / Check">
											<path
												id="Vector"
												d="M6 12L10.2426 16.2426L18.727 7.75732"
												stroke-width="2"
												stroke-linecap="round"
												stroke-linejoin="round"
											></path>
										</g>
									</g>
								</svg>
							</div>
							<span>{{ item.title }}</span>
						</li>
					</ul>
				</div>
			</Tab>
		</TabsWrapper>
	</section>
</template>

<script setup>
import { ref, onMounted } from 'vue';
import Tab from '@/components/universal/tabs/Tab';
import TabsWrapper from '@/components/universal/tabs/TabsWrapper';

const stages = ref([
	{
		title: 'Сбор данных и аналитика',
		tabContentTop:
			'Самое важное на этом этапе — получить ясное и полное понимание того, каким будет назначение вашего будущего сайта, каких целей вы хотите достичь с его помощью, а также какова целевая аудитория, которую вы хотите на него привлечь. <br/><br/> Детально составленный план, созданный на основе данных, полученных на этом этапе, позволит определить наилучшую стратегию дальнейшего развития проекта.',
		tabConBotR: [
			{ title: 'Выявление целей сайта' },
			{ title: 'Определение и анализ целевой аудитории' },
			{ title: 'Исследования конкурентов' },
		],
		tabConBotL: [
			{ title: 'Выявление основных преимуществ' },
			{ title: 'Структурирование полученных данных' },
		],
	},
	{
		title: 'Макетирование и подготовка ТЗ',
		tabContentTop:
			'После того, как все необходимые данные о компании собраны, мы прорабатываем структуру и навигацию будущего сайта и создаем макеты страниц. <br/><br/> Макетирование сайта – это создание схематичной модели будущего сайта. <br/><br/> Данный процесс позволяет грамотно продумать расположение нужных блоков и элементов дизайна, увидеть наглядно концепцию будущего сайта, правильно организовать систему навигации на сайте, продумать возможности взаимодействия посетителя с сайтом.',
		tabConBotR: [
			{ title: 'Разработка прототипа главной страницы' },
			{ title: 'Разработка прототипов внутренних страниц' },
		],
		tabConBotL: [{ title: 'Подготовка и согласования Технического Задания' }],
	},
	{
		title: 'Разработка дизайна страниц сайта',
		tabContentTop:
			'На этом этапе веб-сайт становится еще ближе к своей окончательной форме. Вся информация, которая была собрана на самой первой стадии проекта, крайне важна на этом шаге. Интересы заказчика, а также целевая аудитория, должны учитываться в первую очередь во время работы над дизайном. <br/><br/> Дизайнером на данном этапе создается дизайн-макет страниц. Основное назначение дизайн-макета —визуализировать структуру страницы, ее содержимое, а также отобразить основной функционал.',
		tabConBotR: [
			{ title: 'Разработка дизайна главной страницы' },
			{ title: 'Разработка дизайна внутренних страниц' },
			{ title: 'Разработка дизайна форм захвата' },
		],
		tabConBotL: [
			{ title: 'Проработка адаптивности для планшетов' },
			{ title: 'Проработка адаптивности для смартфонов' },
		],
	},
	{
		title: 'Вёрстка',
		tabContentTop:
			'После разработки и полной модерации дизайн-макетов страниц сайта проводится верстка всех страниц. Верстка сайта представляет собой описание программным кодом визуальной части веб-сайта. <br/><br/> Независимо от того, какой браузер и устройство (desktop/mobile) использует пользователь, сайт должен выглядеть и работать корректно при любом разрешении экрана.',
		tabConBotR: [
			{
				title:
					'Создание таблиц стилей CSS, где определяется цветовая гамма, шрифты и расположение элементов.',
			},
			{ title: 'Разработка меню, интерфейса.' },
		],
		tabConBotL: [
			{
				title:
					'Макет страницы сравнивается с макетом дизайна на полное совпадение.',
			},
			{
				title:
					'Страницы тестируется на разных устройствах и браузерах на разных разрешениях экрана.',
			},
		],
	},
	{
		title: 'Программирование и интеграция',
		tabContentTop:
			'Программирование сайта – это работа, которая связывает воедино веб-графику и функциональную составляющую ресурса. В техническом плане этот этап является наиболее сложным по реализации. <br/><br/> На этом этапе происходит установка CMS. Все статичные элементы веб-сайта, дизайн которых был разработан ранее при создании шаблона, превращаются в реальные динамические интерактивные элементы веб-страницы. Так же на этом этапе выполняется настройка интеграции сайта с 1С и подключение необходимых модулей, online сервисов и т.д.',
		tabConBotR: [
			{ title: 'Установка системы управления' },
			{ title: 'Разработка эксклюзивных модулей' },
		],
		tabConBotL: [
			{ title: 'Подключение модулей и компонентов' },
			{
				title:
					'Интеграция с 1С, системой online оплаты, online консультантом и т.д.',
			},
		],
	},
	{
		title: 'Наполнение сайта контентом',
		tabContentTop:
			'Процесс создания контента обычно проходит параллельно с другими стадиями разработки и его роль не стоит недооценивать. На данном шаге необходимо описать самую суть того, что вы хотите донести до аудитории своего веб-сайта, а также добавить CTA (призыв к действию). <br/><br/> Эта стадия включает в себя также создание привлекательных и броских заголовков, написание и редактирование текста, компиляцию существующих текстов и т.д. Как правило, заказчик предоставляет контент, уже готовый к тому, чтобы быть размещенным на сайте. Если требуется подготовка контента силами Исполнителя, то данная услуга предоставляется за дополнительную плату.',
		tabConBotR: [
			{ title: 'Наполнение разделов и страниц сайта' },
			{ title: 'Создание меню' },
			{ title: 'Загрузка необходимых фотографий' },
		],
		tabConBotL: [
			{ title: 'Создание разделов и страниц сайта' },
			{ title: 'Наполнение каталогов товарами и услугами' },
		],
	},
	{
		title: 'Тестирование и запуск проекта',
		tabContentTop:
			'Тестирование является, наверное, самой рутинной частью разработки. Каждая ссылка должна быть проверена, каждая форма и каждый скрипт должны быть протестированы. Для проверки соответствия верстки современным веб-стандартам используются валидаторы кода. <br/><br/> Также крайне важно проверить разработанный сайт на кроссбраузерную совместимость. После полного тестирования сайт переносится с тестового сервера на основной сервер заказчика, после чего тестируется повторно, для поиска ошибок, которые могли возникнуть в результате переноса. После этого проект считается сданным клиенту.',
		tabConBotR: [
			{ title: 'Перенос сайта на рабочий сервер' },
			{ title: 'Тестирование на ошибки' },
		],
		tabConBotL: [
			{ title: 'Проверка валидности кода' },
			{ title: 'Оптимизация работы сервера' },
		],
	},
]);
</script>
